Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets_post will be created
  + resource "aws_api_gateway_method_response" "datasets_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.dportal_proxy will be created
  + resource "aws_api_gateway_method_response" "dportal_proxy" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.entry_types will be created
  + resource "aws_api_gateway_method_response" "entry_types" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.filtering_terms will be created
  + resource "aws_api_gateway_method_response" "filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants will be created
  + resource "aws_api_gateway_method_response" "g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id will be created
  + resource "aws_api_gateway_method_response" "g_variants-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants_post will be created
  + resource "aws_api_gateway_method_response" "g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals will be created
  + resource "aws_api_gateway_method_response" "individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id will be created
  + resource "aws_api_gateway_method_response" "individuals-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals_post will be created
  + resource "aws_api_gateway_method_response" "individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.info will be created
  + resource "aws_api_gateway_method_response" "info" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.map will be created
  + resource "aws_api_gateway_method_response" "map" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.projects will be created
  + resource "aws_api_gateway_method_response" "projects" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.root-get will be created
  + resource "aws_api_gateway_method_response" "root-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs will be created
  + resource "aws_api_gateway_method_response" "runs" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id will be created
  + resource "aws_api_gateway_method_response" "runs-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id_post will be created
  + resource "aws_api_gateway_method_response" "runs-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs_post will be created
  + resource "aws_api_gateway_method_response" "runs_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_settings.BeaconApi will be created
  + resource "aws_api_gateway_method_settings" "BeaconApi" {
      + id          = (known after apply)
      + method_path = "*/*"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = (known after apply)
          + metrics_enabled                            = (known after apply)
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 1000
          + throttling_rate_limit                      = 100
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.sbeacon.aws_api_gateway_resource.admin will be created
  + resource "aws_api_gateway_resource" "admin" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "admin"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.admin_proxy will be created
  + resource "aws_api_gateway_resource" "admin_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses will be created
  + resource "aws_api_gateway_resource" "analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-filtering_terms will be created
  + resource "aws_api_gateway_resource" "analyses-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id will be created
  + resource "aws_api_gateway_resource" "analyses-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id-g_variants will be created
  + resource "aws_api_gateway_resource" "analyses-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples will be created
  + resource "aws_api_gateway_resource" "biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_resource" "biosamples-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id will be created
  + resource "aws_api_gateway_resource" "biosamples-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-analyses will be created
  + resource "aws_api_gateway_resource" "biosamples-id-analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_resource" "biosamples-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-runs will be created
  + resource "aws_api_gateway_resource" "biosamples-id-runs" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "runs"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.configuration will be created
  + resource "aws_api_gateway_resource" "configuration" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "configuration"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets will be created
  + resource "aws_api_gateway_resource" "datasets" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "datasets"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-filtering_terms will be created
  + resource "aws_api_gateway_resource" "datasets-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id will be created
  + resource "aws_api_gateway_resource" "datasets-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-biosamples will be created
  + resource "aws_api_gateway_resource" "datasets-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_resource" "datasets-id-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-g_variants will be created
  + resource "aws_api_gateway_resource" "datasets-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-individuals will be created
  + resource "aws_api_gateway_resource" "datasets-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal will be created
  + resource "aws_api_gateway_resource" "dportal" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "dportal"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal_proxy will be created
  + resource "aws_api_gateway_resource" "dportal_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.entry_types will be created
  + resource "aws_api_gateway_resource" "entry_types" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "entry_types"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.filtering_terms will be created
  + resource "aws_api_gateway_resource" "filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants will be created
  + resource "aws_api_gateway_resource" "g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id will be created
  + resource "aws_api_gateway_resource" "g_variants-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_resource" "g_variants-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-individuals will be created
  + resource "aws_api_gateway_resource" "g_variants-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals will be created
  + resource "aws_api_gateway_resource" "individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-filtering_terms will be created
  + resource "aws_api_gateway_resource" "individuals-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id will be created
  + resource "aws_api_gateway_resource" "individuals-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-biosamples will be created
  + resource "aws_api_gateway_resource" "individuals-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-g_variants will be created
  + resource "aws_api_gateway_resource" "individuals-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.info will be created
  + resource "aws_api_gateway_resource" "info" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "info"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.map will be created
  + resource "aws_api_gateway_resource" "map" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "map"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.projects will be created
  + resource "aws_api_gateway_resource" "projects" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "projects"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs will be created
  + resource "aws_api_gateway_resource" "runs" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "runs"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-filtering_terms will be created
  + resource "aws_api_gateway_resource" "runs-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id will be created
  + resource "aws_api_gateway_resource" "runs-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id-analyses will be created
  + resource "aws_api_gateway_resource" "runs-id-analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id-g_variants will be created
  + resource "aws_api_gateway_resource" "runs-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_rest_api.BeaconApi will be created
  + resource "aws_api_gateway_rest_api" "BeaconApi" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API That implements the Beacon specification"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "sbeacon-backend-api"
      + policy                       = (known after apply)
      + region                       = "ap-southeast-3"
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be created
  + resource "aws_api_gateway_stage" "BeaconApi" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "ap-southeast-3"
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be created
  + resource "aws_athena_workgroup" "sbeacon-workgroup" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "query_workgroup"
      + region        = "ap-southeast-3"
      + state         = "ENABLED"
      + tags_all      = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + configuration {
          + enforce_workgroup_configuration    = false
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + engine_version {
              + effective_engine_version = (known after apply)
              + selected_engine_version  = "Athena engine version 3"
            }

          + result_configuration {
              + output_location = (known after apply)
            }
        }
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-index-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms_index"
        }
      + policy_body   = (known after apply)
      + region        = "ap-southeast-3"
      + tags_all      = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = (known after apply)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms"
        }
      + policy_body   = (known after apply)
      + region        = "ap-southeast-3"
      + tags_all      = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = (known after apply)
    }

  # module.sbeacon.aws_cloudfront_cache_policy.api will be created
  + resource "aws_cloudfront_cache_policy" "api" {
      + arn         = (known after apply)
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "sbeacon-backend-api"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.sbeacon.aws_cloudfront_distribution.api_distribution will be created
  + resource "aws_cloudfront_distribution" "api_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "sbeacon-backend-api"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = 0
          + max_ttl                  = 0
          + min_ttl                  = 0
          + origin_request_policy_id = (known after apply)
          + target_origin_id         = "sbeacon-backend-api"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "https-only"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "sbeacon-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.sbeacon.aws_cloudfront_origin_request_policy.api will be created
  + resource "aws_cloudfront_origin_request_policy" "api" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "sbeacon-backend-api"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "allExcept"

          + headers {
              + items = [
                  + "Host",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be created
  + resource "aws_dynamodb_table" "anscestor_terms" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "term"
      + id               = (known after apply)
      + name             = "sbeacon-Anscestors"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "term"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be created
  + resource "aws_dynamodb_table" "clinic_jobs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "job_id"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinic-jobs"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "job_id"
          + type = "S"
        }
      + attribute {
          + name = "project_name"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "project_name"
          + name               = "project-name-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be created
  + resource "aws_dynamodb_table" "clinical_annotations" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-annotations"
      + range_key        = "annotation_name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "annotation_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be created
  + resource "aws_dynamodb_table" "clinical_variants" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-variants"
      + range_key        = "collection_name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "collection_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be created
  + resource "aws_dynamodb_table" "dataportal_locks_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockId"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-mutex-locks"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockId"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache will be created
  + resource "aws_dynamodb_table" "dataportal_pricing_cache" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "resource"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-pricing-cache"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "resource"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be created
  + resource "aws_dynamodb_table" "descendant_terms" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "term"
      + id               = (known after apply)
      + name             = "sbeacon-Descendants"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "term"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be created
  + resource "aws_dynamodb_table" "juptyer_notebooks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-juptyer-notebooks"
      + range_key        = "instanceName"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "instanceName"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be created
  + resource "aws_dynamodb_table" "ontologies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "sbeacon-Ontologies"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be created
  + resource "aws_dynamodb_table" "project_users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-project-users"
      + range_key        = "uid"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "uid"
          + name               = "uid-index"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + range_key          = "name"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be created
  + resource "aws_dynamodb_table" "projects" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-projects"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be created
  + resource "aws_dynamodb_table" "saved_queries" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-saved-queries"
      + range_key        = "name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "O
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.